cmsis-svd/cmsis-svd/data/Microchip/ATSAM3NxC.svd
        <register>
          <name>CSR_SPI_MODE</name>
          <description>Channel Status Register</description>
          <alternateGroup>SPI_MODE</alternateGroup>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXRDY</name>
              <description>Receiver Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXRDY</name>
              <description>Transmitter Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVRE</name>
              <description>Overrun Error</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>Transmitter Empty</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UNRE</name>
              <description>Underrun Error</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RHR</name>
          <description>Receiver Holding Register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXCHR</name>
              <description>Received Character</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXSYNH</name>
              <description>Received Sync</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>THR</name>
          <description>Transmitter Holding Register</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>TXCHR</name>
              <description>Character to be Transmitted</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXSYNH</name>
              <description>Sync Field to be transmitted</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BRGR</name>
          <description>Baud Rate Generator Register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CD</name>
              <description>Clock Divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FP</name>
              <description>Fractional Part</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTOR</name>
          <description>Receiver Time-out Register</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TO</name>
              <description>Time-out Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TTGR</name>
          <description>Transmitter Timeguard Register</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TG</name>
              <description>Timeguard Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIDI</name>
          <description>FI DI Ratio Register</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000174</resetValue>
          <fields>
            <field>
              <name>FI_DI_RATIO</name>
              <description>FI Over DI Ratio Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NER</name>
          <description>Number of Errors Register</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NB_ERRORS</name>
              <description>Number of Errors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>IrDA Filter Register</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IRDA_FILTER</name>
              <description>IrDA Filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WPMR</name>
          <description>Write Protect Mode Register</description>
          <addressOffset>0x000000E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WPEN</name>
              <description>Write Protect Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WPKEY</name>
              <description>Write Protect KEY</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WPSR</name>
          <description>Write Protect Status Register</description>
          <addressOffset>0x000000E8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WPVS</name>
              <description>Write Protect Violation Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WPVSRC</name>
              <description>Write Protect Violation Source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
